kAMDSuccess = "Ei virhettä.";
kAMDUndefinedError = "Tapahtui tuntematon virhe.";
kAMDBadHeaderError = "Tiedostoa ei voitu siirtää.";
kAMDNoResourcesError = "Resurssia ei voitu varata.";
kAMDReadError = "Laitteesta ei voitu lukea.";
kAMDWriteError = "Laitteeseen ei voitu kirjoittaa.";
kAMDUnknownPacketError = "Paketti on tuntematon.";
kAMDInvalidArgumentError = "Virheellinen argumentti.";
kAMDNotFoundError = "Tiedostoa ei löytynyt.";
kAMDIsDirectoryError = "Polku on hakemisto.";
kAMDPermissionError = "Sinulla ei ole oikeutta.";
kAMDNotConnectedError = "Ei yhteydessä laitteeseen.";
kAMDTimeOutError = "Toiminto aikakatkaistiin.";
kAMDOverrunError = "Tapahtui puskurin ylivuoto.";
kAMDEOFError = "Tiedoston loppu.";
kAMDUnsupportedError = "Toimintoa ei tueta.";
kAMDFileExistsError = "Tiedosto on jo olemassa.";
kAMDBusyError = "Laite on varattu.";
kAMDCryptoError = "Suojattua yhteyttä laitteeseen ei voitu luoda.";
kAMDTooBigError = "Viesti on liian suuri.";
kAMDInvalidResponseError = "Laitteelta vastaanotettiin odottamaton vastaus.";
kAMDMissingKeyError = "Avain puuttuu.";
kAMDMissingValueError = "Arvo puuttuu.";
kAMDGetProhibitedError = "Arvoa ei voitu hakea salasanasuojatusta laitteesta.";
kAMDSetProhibitedError = "Laitteelle ei voida asettaa arvoa.";
kAMDRemoveProhibitedError = "Laitteesta ei voida poistaa arvoa.";
kAMDImmutableValueError = "Arvoa ei voida muuttaa.";
kAMDPasswordProtectedError = "Laite on salasanasuojattu.";
kAMDMissingHostIDError = "Laite ei tunnista tätä palvelinta.";
kAMDInvalidHostIDError = "Laite ei tunnista tätä palvelinta.";
kAMDSessionActiveError = "Aktiivinen istunto.";
kAMDSessionInactiveError = "Istunto ei ole aktiivinen.";
kAMDMissingSessionIDError = "Istunnon tunnus puuttuu.";
kAMDInvalidSessionIDError = "Virheellinen istunnon tunnus.";
kAMDMissingServiceError = "Palvelu puuttuu.";
kAMDInvalidServiceError = "Virheellinen palvelu.";
kAMDServiceLimitError = "Tällä palvelulla on jo liian monta ilmentymää käytössä.";
kAMDCheckinSetupFailedError = "Palvelua ei voitu käynnistää laitteessa";
kAMDInvalidCheckinError = "Palvelua ei voitu käynnistää laitteessa";
kAMDCheckinTimeoutError = "Palvelu ei käynnistynyt laitteessa oikein.";
kAMDCheckinConnectionFailedError = "Palvelu ei käynnistynyt laitteessa oikein.";
kAMDCheckinReceiveFailedError = "Palvelu ei käynnistynyt laitteessa oikein.";
kAMDCheckinResponseFailedError = "Palvelu ei käynnistynyt laitteessa oikein.";
kAMDCheckinOutOfMemoryError = "Palvelu ei käynnistynyt laitteessa oikein.";
kAMDCheckinSendFailedError = "Palvelu ei käynnistynyt laitteessa oikein.";
kAMDMissingPairRecordError = "Palvelimen ja laitteen välillä ei ole muodostettu paria.";
kAMDInvalidPairRecordError = "Palvelin ja laite eivät muodosta enää paria.";
kAMDSavePairRecordFailedError = "Paritietuetta ei voitu tallentaa.";
kAMDInvalidActivationRecordError = "Virheellinen aktivointitietue.";
kAMDMissingActivationRecordError = "Aktivointitietuetta ei löytynyt.";
kAMDServiceProhibitedError = "Palvelua ei voitu käynnistää laitteessa.";
kAMDEscrowLockedError = "Poista lukitus käynnistyksen jälkeen, jotta voit käyttää laitetta.";
kAMDProhibitedBySupervision = "Toiminto kielletty valvotuissa laitteissa.";
kAMDPairingProhibitedError = "Parinmuodostus sallittu vain USB:n avulla.";
kAMDWrongDroidError = "Laite on palautustilassa.";
kAMDSUVerificationError = "Ohjelmistonpäivityspakettia ei voitu varmentaa.";
kAMDSUPatchError = "Tiedostoa ei voitu korjata.";
kAMDSUFirmwareError = "Laiteohjelmistoa ei voitu päivittää.";
kAMDProvisioningProfileNotValid = "Provisiointiprofiili ei ole kelvollinen.";
kAMDSendMessageError = "Laitteeseen ei voitu lähettää viestiä.";
kAMDReceiveMessageError = "Laitteesta ei vastaanotettu viestiä.";
kAMDMissingOptionsError = "Asetukset puuttuvat.";
kAMDMissingImageTypeError = "Tiedosto puuttuu.";
kAMDDigestFailedError = "Levytiedostoa ei voitu lukea.";
kAMDStartServiceError = "Palvelua ei voitu käynnistää.";
kAMDInvalidDiskImageError = "Virheellinen levytiedosto.";
kAMDMissingDigestError = "Lyhennelmä puuttuu.";
kAMDMuxError = "USB-laitteen kanavointivirhe.";
kAMDApplicationAlreadyInstalledError = "Järjestelmäohjelma, jolla on annettu nipun tunniste, on jo asennettu laitteeseen eikä sitä voida korvata.";
kAMDApplicationMoveFailedError = "Ohjelmaa ei voitu siirtää paikalleen laitteessa.";
//kAMDApplicationSINFCaptureFailedError = "";
kAMDApplicationSandboxFailedError = "Ohjelmaa ei voitu eristää.";
kAMDApplicationVerificationFailedError = "Ohjelmaa ei voitu varmentaa.";
kAMDArchiveDestructionFailedError = "Ohjelma-arkistoa ei voitu poistaa.";
kAMDBundleVerificationFailedError = "Operaattorinippua ei voitu varmentaa.";
kAMDCarrierBundleCopyFailedError = "Operaattorinippua ei voitu asentaa.";
kAMDCarrierBundleDirectoryCreationFailedError = "Operaattorinippuhakemistoa ei voitu luoda.";
kAMDCarrierBundleMissingSupportedSIMsError = "Ei tuettuja SIM-kortteja tälle operaattorinipulle.";
kAMDCommCenterNotificationFailedError = "Ei ilmoituksia kantataajuuskaistalta.";
kAMDContainerCreationFailedError = "Ohjelmasäiliötä ei voitu luoda.";
kAMDContainerP0wnFailedError = "Ohjelmasäiliön oikeuksia ei voitu korjata.";
kAMDContainerRemovalFailedError = "Ohjelmasäiliötä ei voitu poistaa.";
kAMDEmbeddedProfileInstallFailedError = "Sisällytettyjä provisiointiprofiileja ei voitu asentaa.";
kAMDErrorError = "Tapahtui virhe.";
kAMDExecutableTwiddleFailedError = "Ohjelman suoritusoikeuksia ei voitu muuttaa.";
kAMDExistenceCheckFailedError = "Ohjelman olemassaoloa ei voitu tarkastaa.";
kAMDInstallMapUpdateFailedError = "Asennettujen ohjelmien luetteloa ei voitu päivittää.";
kAMDManifestCaptureFailedError = "Ohjelman luetteloa ei voitu tallentaa.";
kAMDMapGenerationFailedError = "Karttaa ei voitu luoda.";
kAMDMissingBundleExecutableError = "Ohjelmanipussa ei ole suorittavaa ohjelmaa.";
kAMDMissingBundleIdentifierError = "Ohjelmanipussa on virheellinen tunnus.";
kAMDMissingBundlePathError = "Ohjelmanipun polkua ei voitu määrittää.";
kAMDMissingContainerError = "Asennetun ohjelman säiliötä ei löytynyt.";
kAMDNotificationFailedError = "Ilmoitusta ei voitu lähettää.";
kAMDPackageExtractionFailedError = "Ohjelmapakettia ei voitu avata.";
kAMDPackageInspectionFailedError = "Ohjelmapakettia ei voitu tarkastaa.";
kAMDPackageMoveFailedError = "Ohjelmapakettia ei voitu siirtää väliaikaiseen sijaintiin.";
kAMDPathConversionFailedError = "Polkua ei voitu muuntaa.";
kAMDRestoreContainerFailedError = "Ohjelmasäiliötä ei voitu palauttaa.";
kAMDSeatbeltProfileRemovalFailedError = "Ohjelman suojausprofiilia ei voitu poistaa.";
kAMDStageCreationFailedError = "Väliaikaishakemistoa ei voitu luoda.";
kAMDSymlinkFailedError = "Symbolista linkkiä ei voitu luoda.";
kAMDiTunesArtworkCaptureFailedError = "iTunesin kuvitusta ei voitu tallentaa.";
kAMDiTunesMetadataCaptureFailedError = "iTunesin metadataa ei voitu tallentaa.";
kAMDAlreadyArchivedError = "Ohjelma on jo arkistoitu.";
kAMDUnknownCommandError = "Laite ei tunnista tätä komentoa.";
kAMDAPIInternalError = "Sisäinen API-virhe.";
kAMDMuxCreateListenerError = "Ei havaittu USB-laitteita.";
kAMDMuxGetListenerError = "USB-laitteiden tunnistin ei toimi.";
kAMDMuxConnectError = "Ei yhteyttä laitteeseen.";
kAMDDeviceTooNewError = "Ohjelma täytyy päivittää.";
kAMDDeviceRefNoGood = "Tämä laite ei ole enää yhteydessä.";
kAMDDeviceDisconnectedError = "Tämä laite ei ole enää yhteydessä.";
kAMDCannotTranslateError = "Laitteen viestejä ei voitu kääntää";
kAMDMobileImageMounterMissingImageSignature = "Kehitystä ei voitu tukea.";
kAMDMobileImageMounterResponseCreationFailed = "Kehitystä ei voitu tukea.";
kAMDMobileImageMounterMissingImageType = "Kehitystä ei voitu tukea.";
kAMDMobileImageMounterMissingImagePath = "Kehitystä ei voitu tukea.";
kAMDMobileImageMounterImageMapLoadFailed = "Kehitystä ei voitu tukea.";
kAMDMobileImageMounterAlreadyMounted = "Kehitystä ei voitu tukea.";
kAMDMobileImageMounterImageMoveFailed = "Kehitystä ei voitu tukea.";
kAMDMobileImageMounterMountPathMissing = "Kehitystä ei voitu tukea.";
kAMDMobileImageMounterMountPathNotEmpty = "Kehitystä ei voitu tukea.";
kAMDMobileImageMounterImageMountFailed = "Kehitystä ei voitu tukea.";
kAMDMobileImageMounterTrustCacheLoadFailed = "Kehitystä ei voitu tukea.";
kAMDMobileImageMounterDigestFailed = "Kehitystä ei voitu tukea.";
kAMDMobileImageMounterDigestCreationFailed = "Kehitystä ei voitu tukea.";
kAMDMobileImageMounterImageVerificationFailed = "Kehitystä ei voitu tukea.";
kAMDMobileImageMounterImageInfoCreationFailed = "Kehitystä ei voitu tukea.";
kAMDMobileImageMounterImageMapStoreFailed = "Kehitystä ei voitu tukea.";
kAMDDeviceOSVersionTooLow = "Laitteen OS-versio on liian vanha.";
kAMDNoWifiSyncSupportError = "Laite ei tue langatonta synkronointia.";
kAMDDeviceFamilyNotSupported = "Tämä ohjelma ei tue tämänlaista laitetta.";
kAMDPackagePatchFailedError = "Korjauspäivitystä ei voitu käyttää ohjelmalle.";
kAMDIncorrectArchitectureError = "Tämä ohjelma tukee tämän laitteen CPU-tyyppiä.";
kAMDPluginCopyFailedError = "VPN-liitännäistä ei voitu kopioida ohjelmasäiliöön.";
kAMDBreadcrumbFailedError = "Asennuksen linkkipolkua ei voitu kirjoittaa.";
kAMDBreadcrumbUnlockError = "Asennuksen linkkipolkua ei voitu päivittää.";
kAMDGeoJSONCaptureFailedError = "GeoJSON-dataa ei voitu tallentaa.";
kAMDNewsstandArtworkCaptureFailedError = "Lehtikioskin kuvitusta ei voitu tallentaa.";
kAMDMissingCommandError = "Pyynnössä ei ollut komentoa.";
kAMDNotEntitledError = "Tämä pyyntö ei ole sallittu pyytävälle ohjelmalle.";
kAMDMissingPackagePathError = "Pyynnöstä puuttui paketin polku.";
kAMDMissingContainerPathError = "Pyynnöstä puuttui säilön polku.";
kAMDMissingApplicationIdentifierError = "Pyynnöstä puuttui ohjelmatunniste.";
kAMDMissingAttributeValueError = "Pyynnöstä puuttui vaadittu arvo.";
kAMDLookupFailedError = "Asennettuja ohjelmia ei voitu luetteloida.";
kAMDDictCreationFailedError = "Pyynnöstä ei voitu purkaa ominaisuuksia.";

/* kMISFileError */
"A file operation failed." = "Tiedostotoiminto epäonnistui.";

/* kMISModifiedResourcesError */
"A signed resource has been added, modified, or deleted." = "Allekirjoitettu resurssi lisätty, muokattu tai poistettu.";

/* kMISInvalidSignerError */
"A valid provisioning profile for this executable was not found." = "Suoritettavalle tiedostolle ei löytynyt kelvollista provisiointiprofiilia.";

/* kMISUnknownError */
"An unknown error has occurred." = "Tapahtui tuntematon virhe.";

/* kMISNotMutableError */
"Attempted to modify an immutable provisioning profile." = "Yritettiin muokata pysyvää provisiointiprofiilia.";

/* kMISApplicationSignatureNotValidError */
"The application does not have a valid signature." = "Ohjelmalla ei ole kelvollista allekirjoitusta.";

/* kMISApplicationSignatureNotValidError */
"The application's signature is valid but it does not match the expected hash." = "Ohjelman allekirjoitus on kelvollinen, mutta se ei täsmää odotetun arvon kanssa.";

/* kMISAdHocSignatureError */
"The executable contains an invalid signature." = "Suoritettavassa tiedostossa virheellinen allekirjoitus.";

/* kMISInvalidEntitlementError */
"The executable was signed with invalid entitlements." = "Suoritettava tiedosto allekirjoitettu virheellisillä oikeutuksilla.";

/* kMISInvalidSignerCertError */
"The identity used to sign the executable is no longer valid." = "Suoritettavan tiedoston allekirjoitukseen käytetty identiteetti ei enää voimassa.";

/* kMISSignatureNotValidError */
"The signature was not valid." = "Allekirjoitus ei ole kelvollinen.";

/* kMISConnectionClosedError */
"There was an error communicating with your device." = "Laitteen tietoliikennevirhe.";

/* kMISUnsupportedDeviceError */
"This provisioning profile cannot be installed on this device." = "Provisiointiprofiilia ei voida asentaa tähän laitteeseen.";

/* kMISProfileSignatureNotValidError */
"This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature)." = "Provisiointiprofiililla ei ole kelvollista allekirjoitusta (tai se on kelvollinen, mutta ei-luotettu).";

/* kMISExpiredError */
"This provisioning profile has expired." = "Provisiointiprofiili on vanhentunut.";

/* kMISMalformedProfileError */
"This provisioning profile is malformed." = "Provisiointiprofiili on väärän muotoinen.";

/* kMISUnsupportedVersionError */
"This provisioning profile is unsupported." = "Provisiointiprofiilia ei tueta.";

/* kMISAllocationError */
"Unable to allocate memory." = "Muistia ei voida varata.";

